In [59]:
import pandas as pd
import numpy as np

In [69]:
jan_bins = np.array([0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28])

In [73]:
col_list = ['UserId', 'FirstName', 'LastName', 'TotalCheckins']

jan_df = pd.read_csv('Resources/Jan_checkins.csv', usecols=col_list)
jan_df.groupby('TotalCheckins').count()

               UserId  LastName  FirstName
TotalCheckins
0                  91        91         91
1                  16        16         16
2                   8         8          8
3                  13        13         13
4                  19        19         19
5                  14        14         14
6                  16        16         16
7                  20        20         20
8                  13        13         13
9                  15        15         15
10                 16        16         16
11                 10        10         10
12                 12        12         12
13                  8         8          8
14                  6         6          6
15                  8         8          8
16                  5         5          5
17                  1         1          1
19                  2         2          2
20                  1         1          1
21                  1         1          1

In [53]:
feb_df = pd.read_csv('Resources/Feb_checkins.csv', usecols=col_list)
feb_df

       UserId      LastName FirstName  TotalCheckins
0    75524645           Acy    Trevor             15
1    87585364         Adams     Elyse              0
2    87506651         Adams     Emily              0
3    75524705         Adams   Heather             10
4    75524434         Ahler   Cameron             10
..        ...           ...       ...            ...
290  75524649          Wood      Matt             15
291  85651924         Woods  Jonathan              0
292  75524588  Zegiestowsky      Tina             18
293  86762185      Zimmitti   Anthony              0
294  75524482        Zirkle     Molly             12

[295 rows x 4 columns]

In [55]:
mar_df = pd.read_csv('Resources/March_checkins.csv', usecols=col_list)
mar_df.head

<bound method NDFrame.head of        UserId      LastName FirstName  TotalCheckins
0    75524645           Acy    Trevor             20
1    87585364         Adams     Elyse              0
2    87506651         Adams     Emily              0
3    75524705         Adams   Heather             14
4    75524434         Ahler   Cameron              1
..        ...           ...       ...            ...
290  75524649          Wood      Matt             13
291  85651924         Woods  Jonathan              0
292  75524588  Zegiestowsky      Tina             20
293  86762185      Zimmitti   Anthony              0
294  75524482        Zirkle     Molly             13

[295 rows x 4 columns]>

In [56]:
april_df = pd.read_csv('Resources/April_checkins.csv', usecols=col_list)
april_df

       UserId      LastName FirstName  TotalCheckins
0    75524645           Acy    Trevor             16
1    87585364         Adams     Elyse              0
2    87506651         Adams     Emily              0
3    75524705         Adams   Heather             12
4    75524434         Ahler   Cameron              7
..        ...           ...       ...            ...
290  75524649          Wood      Matt              5
291  85651924         Woods  Jonathan              5
292  75524588  Zegiestowsky      Tina             16
293  86762185      Zimmitti   Anthony              0
294  75524482        Zirkle     Molly              9

[295 rows x 4 columns]

In [74]:
may_df = pd.read_csv('Resources/May_checkins.csv', usecols=col_list)
may_df.groupby('TotalCheckins').count()

               UserId  LastName  FirstName
TotalCheckins
0                  66        66         66
1                  13        13         13
2                   5         5          5
3                  11        11         11
4                  13        13         13
5                  16        16         16
6                  12        12         12
7                  13        13         13
8                  10        10         10
9                  15        15         15
10                 18        18         18
11                 18        18         18
12                 20        20         20
13                  7         7          7
14                  7         7          7
15                  7         7          7
16                  9         9          9
17                  9         9          9
18                 10        10         10
19                  3         3          3
20                  3         3          3
21                  4         4          4
22                  3         3          3
23                  2         2          2
28                  1         1          1